# Imports

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
pd.set_option('display.max_columns', 500)

# Construct Dictionary According to Handbook

In [2]:
df = pd.read_csv("alldata.csv")

relevant_species = list(df['Species_name'].value_counts().index[:10])
attributes = list(df.columns[9:])

def create_species_dict(*absent_phenophases):
    species_dict = dict(zip(attributes, np.zeros(len(attributes), int)))
    for phenophase in absent_phenophases:
        species_dict[phenophase] = 1
    return species_dict

handbook_dicts = {} # Dict mapping species to attribute dicts. 
# Attribute dicts give absent phenophases in the associated species.
# Manually input absent phenophases from SeasonWatch handbook
handbook_dicts[relevant_species[0]] = create_species_dict('Flowers_open','Fruits_open')
handbook_dicts[relevant_species[1]] = create_species_dict('Flowers_male', 'Flowers_Female', 'Fruits_open')
handbook_dicts[relevant_species[2]] = create_species_dict('Flowers_open', 'Fruits_open')
handbook_dicts[relevant_species[3]] = create_species_dict('Flowers_male', 'Flowers_Female', 'Fruits_open')
handbook_dicts[relevant_species[4]] = create_species_dict('Flowers_male', 'Flowers_Female', 'Fruits_open')
handbook_dicts[relevant_species[5]] = create_species_dict('Flowers_male', 'Flowers_Female', 'Fruits_open')
handbook_dicts[relevant_species[6]] = create_species_dict('Flowers_male', 'Flowers_Female', 'Fruits_open')
handbook_dicts[relevant_species[7]] = create_species_dict('Flowers_male', 'Flowers_Female', 'Fruits_open')
handbook_dicts[relevant_species[8]] = create_species_dict('Flowers_male', 'Flowers_Female', 'Fruits_open')
handbook_dicts[relevant_species[9]] = create_species_dict('Flowers_male', 'Flowers_Female')

# Reconstruct alldata.csv With New Columns Indicating Incorrect -2 Values

In [3]:
incorrect_negative_2_df = df.copy()
for attribute in attributes:
    incorrect_negative_2_df[f"{attribute}_incorrect_-2"] = np.zeros(incorrect_negative_2_df.shape[0], dtype=int)

for species in relevant_species:
    species_df = df[df['Species_name'] == species]
    species_dict = handbook_dicts[species]
    for attribute in attributes:
        if species_dict[attribute] == 0:
            false_positive_idx = species_df.index[species_df[attribute] == -2] # Indices of reports that incorrectly assign -2 values (false positive) to phenophases that DO appear in the species
            incorrect_negative_2_df.loc[false_positive_idx, f"{attribute}_incorrect_-2"] = np.ones(len(false_positive_idx)) # Label false positive reports as 1 for the phenophase they incorrectly report.
        if species_dict[attribute] == 1:
            false_negative_idx = species_df.index[species_df[attribute] != -2] # Indices of reports that incorrectly assign values other than -2 (false positive) to phenophases that DO NOT appear in the species
            incorrect_negative_2_df.loc[false_negative_idx, f"{attribute}_incorrect_-2"] = 2*np.ones(len(false_negative_idx)) # Label false negative reports as 2 for the phenophase they incorrectly report.

# Preview CSV File

In [4]:
incorrect_negative_2_df

,Unnamed: 0,Observation_ID,Date_of_observation,User_id,User_Tree_id,Species_name,Lat,Long,State_name,Leaves_fresh,Leaves_mature,Leaves_old,Flowers_bud,Flowers_open,Flowers_male,Flowers_Female,Fruits_unripe,Fruits_ripe,Fruits_open,Leaves_fresh_incorrect_-2,Leaves_mature_incorrect_-2,Leaves_old_incorrect_-2,Flowers_bud_incorrect_-2,Flowers_open_incorrect_-2,Flowers_male_incorrect_-2,Flowers_Female_incorrect_-2,Fruits_unripe_incorrect_-2,Fruits_ripe_incorrect_-2,Fruits_open_incorrect_-2
0,1,388564.0,2020-01-01,20396.0,84299.0,Indian Almond- Terminalia catappa,12.15386,75.22397,Kerala,2.0,0.0,0.0,-2.0,-2.0,-2.0,-2.0,-2.0,-2.0,-2.0,0,0,0,0,0,0,0,0,0,0
1,2,388565.0,2020-01-01,20396.0,84300.0,Indian Almond- Terminalia catappa,12.15386,75.22397,Kerala,2.0,0.0,0.0,-2.0,-2.0,-2.0,-2.0,-2.0,-2.0,-2.0,0,0,0,0,0,0,0,0,0,0
2,3,388566.0,2020-01-01,20396.0,84301.0,Fish-tail palm- Caryota urens,12.14060,75.22145,Kerala,0.0,2.0,0.0,-2.0,-2.0,-2.0,-2.0,-2.0,-2.0,-2.0,0,0,0,0,0,0,0,0,0,0
3,4,388567.0,2020-01-01,20396.0,84302.0,Mast Tree-Monoon longifolium,12.14060,75.22145,Kerala,1.0,2.0,0.0,-2.0,-2.0,-2.0,-2.0,-2.0,-2.0,-2.0,0,0,0,0,0,0,0,0,0,0
4,5,388568.0,2020-01-01,20396.0,84303.0,Indian Almond- Terminalia catappa,12.14060,75.22145,Kerala,0.0,1.0,2.0,-2.0,-2.0,-2.0,-2.0,-2.0,-2.0,-2.0,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
592588,592589,736977.0,2023-12-04,26471.0,124684.0,Jackfruit- Artocarpus heterophyllus,8.53024,77.04296,Kerala,1.0,2.0,1.0,0.0,-2.0,0.0,0.0,0.0,0.0,-2.0,0,0,0,0,0,0,0,0,0,0
592589,592590,736978.0,2023-12-12,26471.0,124684.0,Jackfruit- Artocarpus heterophyllus,8.53024,77.04296,Kerala,1.0,2.0,1.0,0.0,-2.0,1.0,1.0,0.0,0.0,-2.0,0,0,0,0,0,0,0,0,0,0
592590,592591,736979.0,2023-12-20,26471.0,124684.0,Jackfruit- Artocarpus heterophyllus,8.53024,77.04296,Kerala,1.0,2.0,1.0,1.0,-2.0,1.0,1.0,0.0,0.0,-2.0,0,0,0,0,0,0,0,0,0,0
592591,592592,736981.0,2023-12-28,26471.0,124684.0,Jackfruit- Artocarpus heterophyllus,8.53024,77.04296,Kerala,1.0,2.0,1.0,1.0,-2.0,1.0,1.0,0.0,0.0,-2.0,0,0,0,0,0,0,0,0,0,0
592592,592593,736982.0,2023-12-27,26471.0,124684.0,Jackfruit- Artocarpus heterophyllus,8.53024,77.04296,Kerala,1.0,2.0,1.0,1.0,-2.0,1.0,1.0,0.0,0.0,-2.0,0,0,0,0,0,0,0,0,0,0

# Test

In [5]:
# For each species, check if reports for each phenophase is marked appropriately in the incorrect_-2 column.
for species in relevant_species:
    print(f'-----------------------------------\n{species}\n-----------------------------------')
    for attribute in attributes:
        a = incorrect_negative_2_df[incorrect_negative_2_df['Species_name'] == species][[attribute, f'{attribute}_incorrect_-2']]
        #display(a[a[attribute] != -2].drop_duplicates())
        display(a.drop_duplicates())

-----------------------------------
Jackfruit- Artocarpus heterophyllus
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
13               1.0                          0
25               0.0                          0
28               2.0                          0
37              -1.0                          0
104179           NaN                          0
179774          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
13                2.0                           0
17                1.0                           0
71                0.0                           0
23370            -1.0                           0
99511             NaN                           0
187390           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
13             1.0                        0
25             0.0                        0
28             NaN                        0
52             2.0                        0
208           -2.0                        1
171855        -1.0                        0

        Flowers_bud  Flowers_bud_incorrect_-2
13              1.0                         0
28              0.0                         0
177             2.0                         0
208            -2.0                         1
512            -1.0                         0
103952          NaN                         0

       Flowers_open  Flowers_open_incorrect_-2
13              0.0                          2
17             -2.0                          0
20874           1.0                          2
20952          -1.0                          2
20966           2.0                          2
99511           NaN                          2

     Flowers_male  Flowers_male_incorrect_-2
13            2.0                          0
17            1.0                          0
28            NaN                          0
37            0.0                          0
190          -1.0                          0
208          -2.0                          1

     Flowers_Female  Flowers_Female_incorrect_-2
13              1.0                            0
28              NaN                            0
37              0.0                            0
177             2.0                            0
190            -1.0                            0
208            -2.0                            1

        Fruits_unripe  Fruits_unripe_incorrect_-2
13                2.0                           0
17                1.0                           0
25                0.0                           0
208              -2.0                           1
512              -1.0                           0
104179            NaN                           0

       Fruits_ripe  Fruits_ripe_incorrect_-2
13             1.0                         0
17             0.0                         0
177            2.0                         0
208           -2.0                         1
232           -1.0                         0
99511          NaN                         0

     Fruits_open  Fruits_open_incorrect_-2
13          -2.0                         0
28           NaN                         2
177          0.0                         2

-----------------------------------
Mango (all varieties)- Mangifera indica
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
6                1.0                          0
16               2.0                          0
61               0.0                          0
21519           -1.0                          0
100344           NaN                          0
184412          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
6                 2.0                           0
10                1.0                           0
61                0.0                           0
21519            -1.0                           0
184421           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
6              1.0                        0
7              0.0                        0
86             2.0                        0
205           -2.0                        1
20839          NaN                        0
168076        -1.0                        0

        Flowers_bud  Flowers_bud_incorrect_-2
6              -2.0                         1
7               1.0                         0
18              0.0                         0
22              2.0                         0
663            -1.0                         0
104425          NaN                         0

        Flowers_open  Flowers_open_incorrect_-2
6               -2.0                          1
7                0.0                          0
15               1.0                          0
22               2.0                          0
663             -1.0                          0
104058           NaN                          0

        Flowers_male  Flowers_male_incorrect_-2
6               -2.0                          0
164              0.0                          2
20839            NaN                          2
349014           1.0                          2

        Flowers_Female  Flowers_Female_incorrect_-2
6                 -2.0                            0
164                0.0                            2
20839              NaN                            2
349014             1.0                            2

       Fruits_unripe  Fruits_unripe_incorrect_-2
6                1.0                           0
7                0.0                           0
10              -2.0                           1
16               2.0                           0
591             -1.0                           0
69276            NaN                           0

       Fruits_ripe  Fruits_ripe_incorrect_-2
6              0.0                         0
10            -2.0                         1
16             1.0                         0
61             2.0                         0
591           -1.0                         0
69276          NaN                         0

       Fruits_open  Fruits_open_incorrect_-2
6             -2.0                         0
164            0.0                         2
20839          NaN                         2

-----------------------------------
Teak- Tectona grandis
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
19               1.0                          0
193              0.0                          0
210              2.0                          0
33193           -1.0                          0
188544          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
19                0.0                           0
66                1.0                           0
192               2.0                           0
23409            -1.0                           0
190251           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
19             NaN                        0
66             1.0                        0
192            0.0                        0
230            2.0                        0
189342        -2.0                        1
191456        -1.0                        0

        Flowers_bud  Flowers_bud_incorrect_-2
19              0.0                         0
66              1.0                         0
210             2.0                         0
721            -1.0                         0
184355         -2.0                         1

        Flowers_open  Flowers_open_incorrect_-2
19               0.0                          2
66               1.0                          2
210              2.0                          2
721             -1.0                          2
185323          -2.0                          0

     Flowers_male  Flowers_male_incorrect_-2
19            NaN                          0
66           -2.0                          1
192           0.0                          0

     Flowers_Female  Flowers_Female_incorrect_-2
19              NaN                            0
66             -2.0                            1
192             0.0                            0

        Fruits_unripe  Fruits_unripe_incorrect_-2
19                0.0                           0
66                1.0                           0
210               2.0                           0
666              -1.0                           0
180401           -2.0                           1

        Fruits_ripe  Fruits_ripe_incorrect_-2
19              0.0                         0
66              1.0                         0
210             2.0                         0
666            -1.0                         0
180401         -2.0                         1

     Fruits_open  Fruits_open_incorrect_-2
19           NaN                         2
66          -2.0                         0
192          0.0                         2

-----------------------------------
Tamarind- Tamarindus indica
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
20               2.0                          0
26               0.0                          0
40               1.0                          0
729             -1.0                          0
192543          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
20                0.0                           0
26                2.0                           0
45                1.0                           0
729              -1.0                           0
99954             NaN                           0
266938           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
20             NaN                        0
26             0.0                        0
32             1.0                        0
59             2.0                        0
729           -1.0                        0
186453        -2.0                        1

        Flowers_bud  Flowers_bud_incorrect_-2
20              2.0                         0
26              0.0                         0
45              1.0                         0
381            -1.0                         0
182091         -2.0                         1

        Flowers_open  Flowers_open_incorrect_-2
20               0.0                          0
45               1.0                          0
59               2.0                          0
381             -1.0                          0
182091          -2.0                          1

     Flowers_male  Flowers_male_incorrect_-2
20            NaN                          2
26           -2.0                          0
165           0.0                          2

     Flowers_Female  Flowers_Female_incorrect_-2
20              NaN                            2
26             -2.0                            0
165             0.0                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
20                2.0                           0
26                0.0                           0
60                1.0                           0
729              -1.0                           0
99958             NaN                           0
182091           -2.0                           1

        Fruits_ripe  Fruits_ripe_incorrect_-2
20              2.0                         0
32              1.0                         0
103             0.0                         0
729            -1.0                         0
99954           NaN                         0
182091         -2.0                         1

     Fruits_open  Fruits_open_incorrect_-2
20           NaN                         2
26          -2.0                         0
165          0.0                         2

-----------------------------------
Indian laburnum- Cassia fistula
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
9                1.0                          0
56               0.0                          0
138              2.0                          0
26395           -1.0                          0
193122          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
9                 2.0                           0
51                1.0                           0
96                0.0                           0
26464            -1.0                           0
104108            NaN                           0
192360           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
9              0.0                        0
33             1.0                        0
138            NaN                        0
436            2.0                        0
178361        -2.0                        1
180377        -1.0                        0

     Flowers_bud  Flowers_bud_incorrect_-2
9           -2.0                         1
33           0.0                         0
51           1.0                         0
420          2.0                         0
662         -1.0                         0

     Flowers_open  Flowers_open_incorrect_-2
9            -2.0                          1
33            0.0                          0
51            2.0                          0
56            1.0                          0
662          -1.0                          0

     Flowers_male  Flowers_male_incorrect_-2
9            -2.0                          0
138           NaN                          2
420           0.0                          2

     Flowers_Female  Flowers_Female_incorrect_-2
9              -2.0                            0
138             NaN                            2
420             0.0                            2

     Fruits_unripe  Fruits_unripe_incorrect_-2
9             -2.0                           1
33             0.0                           0
56             1.0                           0
382            2.0                           0
662           -1.0                           0

     Fruits_ripe  Fruits_ripe_incorrect_-2
9           -2.0                         1
33           1.0                         0
51           0.0                         0
157          2.0                         0
662         -1.0                         0

     Fruits_open  Fruits_open_incorrect_-2
9           -2.0                         0
138          NaN                         2
420          0.0                         2

-----------------------------------
Amla- Phyllanthus emblica
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
24               0.0                          0
88               1.0                          0
137              2.0                          0
25404           -1.0                          0
231596          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
24                0.0                           0
88                1.0                           0
137               2.0                           0
26507            -1.0                           0
99960             NaN                           0
231596           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
24             0.0                        0
88             1.0                        0
425            2.0                        0
20834          NaN                        0
186331        -2.0                        1
186715        -1.0                        0

        Flowers_bud  Flowers_bud_incorrect_-2
24              0.0                         0
88              1.0                         0
20906          -1.0                         0
21241           2.0                         0
174948         -2.0                         1

        Flowers_open  Flowers_open_incorrect_-2
24               0.0                          0
88               1.0                          0
20906           -1.0                          0
20940            2.0                          0
99408            NaN                          0
174948          -2.0                          1

       Flowers_male  Flowers_male_incorrect_-2
24             -2.0                          0
425             0.0                          2
20834           NaN                          2

       Flowers_Female  Flowers_Female_incorrect_-2
24               -2.0                            0
425               0.0                            2
20834             NaN                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
24                0.0                           0
88                1.0                           0
20834             2.0                           0
20906            -1.0                           0
185001           -2.0                           1

        Fruits_ripe  Fruits_ripe_incorrect_-2
24              0.0                         0
88              1.0                         0
20834          -1.0                         0
20948           2.0                         0
186253         -2.0                         1

       Fruits_open  Fruits_open_incorrect_-2
24            -2.0                         0
425            0.0                         2
20834          NaN                         2

-----------------------------------
Jamun- Syzygium cumini
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
128              1.0                          0
218              2.0                          0
235              0.0                          0
33180           -1.0                          0
260345          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
128               1.0                           0
218               2.0                           0
21381             0.0                           0
28517            -1.0                           0
99905             NaN                           0
224756           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
128            1.0                        0
235            0.0                        0
313            2.0                        0
20851          NaN                        0
158245        -1.0                        0
224756        -2.0                        1

        Flowers_bud  Flowers_bud_incorrect_-2
128             1.0                         0
218             0.0                         0
507            -1.0                         0
20851           2.0                         0
178359         -2.0                         1

        Flowers_open  Flowers_open_incorrect_-2
128              1.0                          0
218              0.0                          0
21988            2.0                          0
37444           -1.0                          0
178359          -2.0                          1

       Flowers_male  Flowers_male_incorrect_-2
128            -2.0                          0
218             0.0                          2
20851           NaN                          2

       Flowers_Female  Flowers_Female_incorrect_-2
128              -2.0                            0
218               0.0                            2
20851             NaN                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
128               1.0                           0
218               0.0                           0
20959             2.0                           0
25901            -1.0                           0
183786           -2.0                           1

        Fruits_ripe  Fruits_ripe_incorrect_-2
128             1.0                         0
218             0.0                         0
20945           2.0                         0
32451          -1.0                         0
183786         -2.0                         1

       Fruits_open  Fruits_open_incorrect_-2
128           -2.0                         0
218            0.0                         2
20851          NaN                         2

-----------------------------------
Coconut palm-Cocos nucifera
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
38              -1.0                          0
167              0.0                          0
169              2.0                          0
191              1.0                          0
187675          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
38                2.0                           0
169               0.0                           0
411               1.0                           0
728              -1.0                           0
191385           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
38             0.0                        0
405            1.0                        0
521            2.0                        0
728           -1.0                        0
159059         NaN                        0
187842        -2.0                        1

        Flowers_bud  Flowers_bud_incorrect_-2
38             -1.0                         0
167             1.0                         0
169             0.0                         0
592             2.0                         0
103322         -2.0                         1

        Flowers_open  Flowers_open_incorrect_-2
38              -1.0                          0
167              1.0                          0
169              0.0                          0
415              2.0                          0
182969          -2.0                          1

        Flowers_male  Flowers_male_incorrect_-2
38              -2.0                          0
167              0.0                          2
159059           NaN                          2

        Flowers_Female  Flowers_Female_incorrect_-2
38                -2.0                            0
167                0.0                            2
159059             NaN                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
38               -1.0                           0
167               2.0                           0
169               1.0                           0
681               0.0                           0
103322           -2.0                           1

        Fruits_ripe  Fruits_ripe_incorrect_-2
38              2.0                         0
167             0.0                         0
191             1.0                         0
659            -1.0                         0
184492         -2.0                         1

        Fruits_open  Fruits_open_incorrect_-2
38             -2.0                         0
167             0.0                         2
159059          NaN                         2

-----------------------------------
Neem- Azadirachta indica
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
152              1.0                          0
223              2.0                          0
348             -1.0                          0
20928            0.0                          0
182517          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
152               2.0                           0
223               1.0                           0
348              -1.0                           0
530               0.0                           0
186130           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
152            1.0                        0
181            0.0                        0
348           -1.0                        0
20928          NaN                        0
162944         2.0                        0
182517        -2.0                        1

        Flowers_bud  Flowers_bud_incorrect_-2
152             0.0                         0
348            -1.0                         0
603             1.0                         0
21005           2.0                         0
174949         -2.0                         1

        Flowers_open  Flowers_open_incorrect_-2
152              0.0                          0
348             -1.0                          0
603              1.0                          0
27161            2.0                          0
174949          -2.0                          1

        Flowers_male  Flowers_male_incorrect_-2
152             -2.0                          0
223              0.0                          2
20928            NaN                          2
252273         127.0                          2

        Flowers_Female  Flowers_Female_incorrect_-2
152               -2.0                            0
223                0.0                            2
20928              NaN                            2
252273           127.0                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
152               0.0                           0
348              -1.0                           0
530               1.0                           0
27082             2.0                           0
177727           -2.0                           1
252237            NaN                           0

        Fruits_ripe  Fruits_ripe_incorrect_-2
152             0.0                         0
348            -1.0                         0
603             1.0                         0
46840           2.0                         0
182517         -2.0                         1
252237          NaN                         0

       Fruits_open  Fruits_open_incorrect_-2
152           -2.0                         0
223            0.0                         2
20928          NaN                         2

-----------------------------------
Purple bauhinia- Bauhinia purpurea
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
14               1.0                          0
188              0.0                          0
419              2.0                          0
27525           -1.0                          0
170098          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
14                2.0                           0
81                1.0                           0
26713             0.0                           0
37449            -1.0                           0
188027           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
14             1.0                        0
142            NaN                        0
188            0.0                        0
419            2.0                        0
178356        -2.0                        1
190317        -1.0                        0

        Flowers_bud  Flowers_bud_incorrect_-2
14              1.0                         0
142             0.0                         0
188             2.0                         0
27524          -1.0                         0
170098         -2.0                         1

        Flowers_open  Flowers_open_incorrect_-2
14               2.0                          0
81               1.0                          0
142              0.0                          0
39199           -1.0                          0
185052          -2.0                          1

     Flowers_male  Flowers_male_incorrect_-2
14           -2.0                          0
142           NaN                          2
419           0.0                          2

     Flowers_Female  Flowers_Female_incorrect_-2
14             -2.0                            0
142             NaN                            2
419             0.0                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
14                1.0                           0
142               0.0                           0
188               2.0                           0
37449            -1.0                           0
170098           -2.0                           1

        Fruits_ripe  Fruits_ripe_incorrect_-2
14              2.0                         0
81              1.0                         0
142             0.0                         0
27710          -1.0                         0
170098         -2.0                         1

        Fruits_open  Fruits_open_incorrect_-2
14              1.0                         0
142             NaN                         0
188             0.0                         0
419             2.0                         0
178356         -1.0                         0
185247         -2.0                         1

# Download CSV File

In [6]:
incorrect_negative_2_df.to_csv('alldata_labeling_-2.csv', index=False)